IDENTIFICATION DIVISION.
PROGRAM-ID. AGE-CALCULATOR.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 USER-NAME  PIC A(20).
01 BIRTH-YEAR PIC 9(4).
01 CURRENT-YEAR PIC 9(4) VALUE 2025.
01 AGE          PIC 99.

PROCEDURE DIVISION.
  DISPLAY "Введите ваше имя:".
  ACCEPT USER-NAME.

  DISPLAY "Введите год рождения (например, 1990):".
  ACCEPT BIRTH-YEAR.

  COMPUTE AGE = CURRENT-YEAR - BIRTH-YEAR.

  DISPLAY "Привет, " USER-NAME "! Тебе " AGE " лет.".

  STOP RUN.